Repository: advancedresearch/lojban
Catalog: assets/en-jbo.tmx
Source language: en
Languages: jbo

source: I cannot meow like a cat. I'm a mouse!
jbo: mi na ka'e bacru lo latsna .iri'abo mi smacu

source: This is the first time I've ever recruited a cook.
jbo: pare'u lo nu mi le'ipli lo jukpa cu cabna

source: I cannot revise with this noise.
jbo: mi lo nu kamjunmre tadni na kakne ri'a tu'a lo savru

source: I cannot ride a horse. My leg is broken.
jbo: mi na kakne lo nu selma'e lo xirma .iki'ubo le mi tuple cu spofu

source: I cannot rinse the dishes. There is no water.
jbo: mi na kakne lo nu jacygaigau le palta .iki'ubo le jacysabji na ca sabji

source: I believe that's correct.
jbo: .ia drani

source: Don't do anything he asks.
jbo: .e'unai ko na gasnu lo selcpe be ko'a

source: When you feel lonely, remember the happy moments we spent together.
jbo: ca lo nu do seicni ku .e'u ko morji fi lo selgei be mi'o

source: This mug is made of iron.
jbo: le vi kabri cu tirse

source: I'm very hungry today.
jbo: mi tcexagji ca lo cabdei

source: You're not born evil; you learn how to be evil.
jbo: ko'a palci ca lo nu ko'a genai jbena gi cilre lo ka palci

source: Few people can type using all fingers.
jbo: so'u prenu cu batkyci'a sepi'o ro le xandegji

source: Are all the doors locked?
jbo: xu ro le vorme cu telga'o

source: I cannot sing in Chinese. It's too difficult.
jbo: mi na kakne lo ka sanga bau lo jugbau .iki'ubo ri nadydu'e

source: Tom is singing a beautiful song.
jbo: la tom. sanga lo melselsa'a

source: I am singing in Berber.
jbo: mi sanga bau la berber.

source: I cannot speak Chinese. I can just read it.
jbo: mi kakne lo ka cusku naje tcidu tu'a lo jugbau

source: Tom is speaking in Dutch! I didn't know he knew this language.
jbo: .ue la tom. goi ko'a ca'o tavla fo la dzitumbau .i mi na pu djuno lo du'u ko'a kakne lo ka baupli ra

source: During the meeting, Tom was assigned to a long list of action items.
jbo: ca le nunpe'i cu jibmatygau la tom. lo'i selzu'e ku poi barda

source: Everyone who respects exactly one classmate is respected by exactly two classmates.
jbo: ro da poi sinma pa selctukansa cu se sinma re selctukansa

source: It is presently very difficult to calm down and treat oneself with a book.
jbo: ca ko'a se nandu lo nu ge tu'a ko'a tolfekybi'o gi ko'a tcidu lo cukta

source: Translation is a scholarly discipline.
jbo: lo nunfanva cu se tadni

source: Internet is very slow.
jbo: le kibjo'e cu tcesno

source: Translation is a kind of special skill.
jbo: lo nu fanva cu te'irselstati

source: The end of the world will have to wait.
jbo: lo mujyfa'o cu nitcu lo ka denpa

source: We have everything under control.
jbo: mi'a jitro roda

source: Say it to your sister!
jbo: ko cusku ko'a le do mensi

source: It's an apple and it's on the table.
jbo: da plise je cpana be lo jubme

source: I said enough.
jbo: mi pu cusku lo banzu

source: "Am I going to die?" "No, you are going to rest."
jbo: lu xu mi ba mrobi'o li'u .i lu na go'i .i do ba surla li'u

source: I can't bear his rudeness.
jbo: mi na ka'e renvi lo nu ta jikfanza

source: I can't tolerate his rudeness.
jbo: mi na ka'e curmi lo nu ta to'e clita

source: You ask questions about everything.
jbo: do reisku zo'ei ro da

source: I want that shirt too.
jbo: mi ji'a djica tu'a ta poi creka

source: You boil water in an oven.
jbo: lo do febvi djacu cu nenri lo toknu

source: The people fear war.
jbo: ti poi za'u prenu ku terpa lo nu jamna

source: You know, money is just paper, and that is a real car.
jbo: .i li'a loi jdini cu pelji .aucu'i .i je ti dacti gije karce

source: This paper is magical, it can turn into anything you want.
jbo: .i ti makfa pelji gije kakne loka binxo ro lo seldji

source: She was always very secretive.
jbo: ze'e mutce mipri

source: It happened two years ago.
jbo: ko'a pu fasnu za lo nanca be li re

source: I should go home.
jbo: .ei mi klama lo zdani

source: I should go to bed.
jbo: mi selxau lo nu sipna

source: Yay! I'm happy that it's an apple that I'm eating!
jbo: mi citka lo plise .ui

source: I'm happy the apple I'm eating is green!
jbo: mi citka lo crino .ui plise

source: You have a habit that I'm happy about.
jbo: tcaci .ui do

source: I need the book! Where is it?
jbo: le cukta be'u cu zvati ma

source: Where's the book I need?
jbo: le cukta be'u cu zvati ma

source: Are you no longer in pain?
jbo: .oiro'o bu'onai pei

source: Have you caught that Unicorn yet?
jbo: pavyseljirna kavbu ba'o xu ku

source: I love Spanish!
jbo: mi nelci lo bansupu'a

source: A crocodile ate a dog.
jbo: lo krokodilo pu mo'u citka lo gerku

source: You worked more than I did.
jbo: do pu gunka se mau mi

source: Thank you for climbing this tree to help me.
jbo: ckire do lo nu cpare lo tricu mu'i lo nu sidju mi

source: Every time that I see you, I think of my father.
jbo: ca ro nu mi viska do kei mi pensi lo be mi patfu

source: My sister plays with dolls.
jbo: lo me mi mensi lu kelci le prenu se kelci

source: I live in an old house.
jbo: mi se zdani lo laldo dinju

source: I am whistling in my house.
jbo: mi ca ca'o siclu bu'u lo mi zdani

source: This might interest you.
jbo: la'acu'i ti ba cinri do

source: You work hard!
jbo: do carmi gunka

source: When will you travel to Paris ?
jbo: ba ca ma do klama la .paris.

source: He may have been right.
jbo: sei cumki ra pu drani

source: Seen from space, Earth seems relatively small.
jbo: lo zvati be lo kensa la terdi cu terselmlu lo ka cmalu

source: The dog runs out of the house.
jbo: lo gerku cu bajra to'o ne'i lo zdani

source: You're not dogs.
jbo: do na gerku

source: I can teach you how to steal.
jbo: mi ka'e ctuca do lo nu zerle'a ta'i makau

source: Have a nice meal!
jbo: .i lo kukte do jai li'i citka

source: Tom hates everybody.
jbo: la .tam. xebni ro do

source: Tell her that I am shaving.
jbo: ko cusku lo sedu'u mi ca krevi'u

source: Don't let him touch the computer.
jbo: ko na curmi lo nu pilno lo skami

source: Which language do you teach ?
jbo: do bangu ctuca fo ma

source: I have to dismiss Ken.
jbo: mi ba minde .ei la .ken. lo nu cliva

source: Dayxa is my wife's sister.
jbo: lo .deiksas. mensi lo fetspe be mi

source: He asked me to dance.
jbo: ko'a pu cpedu lonu dansu mi

source: She did it while he was drunk.
jbo: ko'a pu gasnu ca ko'e pu xalbebna

source: That was stupid.
jbo: ta nunbebna

source: She has no remorse.
jbo: ko'a to'e zungi

source: He's not a member.
jbo: ko'a na cmima

source: She's not a member.
jbo: ko'a na cmima

source: What are you suggesting?
jbo: do caca'o stidi ma

source: Does she have a boyfriend?
jbo: xu ko'a se pampe'o

source: Does he have a girlfriend?
jbo: xu ko'a se pampe'o

source: Don't worry. She doesn't understand German.
jbo: .e'u do na'e xanka sei lo bandu'e'u ko'a na bangu

source: What the fuck is that?
jbo: u'ecai tu mo

source: This is a hammer. It's not mine; I borrowed it from a friend.
jbo: ti mruli i ri na se ponse mi i mi pu jbera ri lo pendo

source: This is my ship.
jbo: ti du le brablo pe mi

source: It seemed to be a good idea.
jbo: pu simlu lo ka xamgu sidbo

source: Nara is very old city.
jbo: la .naras. mutce laldo tcadu

source: All things hidden will be seen.
jbo: ro lo se mipri ba se zgana

source: No clouds were in the sky.
jbo: no dilnu pu zvati lo tsani

source: I don't have a pencil
jbo: mi claxu lo pinsi

source: I can't let them leave before the watch is fixed.
jbo: .ei ko'a na cliva pu lo nu ba'o cikre lo junla

source: I speak Lojban.
jbo: mi tavla fo la lojban

source: I speak Spanish.
jbo: mi tavla fo lo spano

source: The little girl is beautiful.
jbo: le cmalu nixli cu melbi

source: I study Lojban.
jbo: mi tadni la lojban

source: I like chess.
jbo: mi nelci lo nu caxmati

source: It's very quiet.
jbo: mutce smaji

source: Are you sad?
jbo: xu do badri

source: I am great.
jbo: mi banli

source: That's a fact.
jbo: la'e di'u fatci

source: Are you sure you want to go to Germany?
jbo: .aipei do nu klama lo dotygu'e kei djica

source: I don't think that this car was made in Germany.
jbo: pe'i le karce na zbasu vi la dotygu'e

source: Is Germany near Italy?
jbo: xu lo dotygu'e cu jibni la .italias.

source: Do you drink beer?
jbo: xu do ta'e pinxe lo birje

source: I am watching this video.
jbo: mi mencti lo vi skina

source: This is an egg.
jbo: ti jipci sovda

source: We actually have four legs.
jbo: je'u ma'a se tuple vo da

source: Do it quickly.
jbo: ko sutra

source: What do you want to do in Germany?
jbo: do djica lo nu zukte ma bu'u la .doitcland.

source: They have wine.
jbo: za'u ko'a ralte lo vanju

source: I'm a dog.
jbo: mi gerku

source: I want to live in the city.
jbo: mi djica lo nu xabju lo tcadu

source: Laurie is beautiful.
jbo: la loris cu melbi

source: He saw the girl.
jbo: ra pu viska lo nixli

source: The weather is rainy.
jbo: lo carvi ku tcima

source: I love you, Laurie.
jbo: mi do prami doi .lorir.

source: Here's my room.
jbo: lo vi kumfa cu tecra'a mi

source: I tried to write with the left hand.
jbo: mi pu troci lo nu ciska se pi'o lo zunle xance

source: There were too many people at the concert.
jbo: du'e prenu pu zvati lo nu zgike tigni

source: Are you aware of their indie work?
jbo: xu do sanji lo selfi'i be ko'a po'o

source: Laurie is slim.
jbo: la loris cu cinla

source: I am fond of Australian food.
jbo: mi nelci lo sralytu'a cidja

source: I'm Icelandic.
jbo: mi islenska

source: I don't have a computer.
jbo: mi na ralte lo skami

source: I'm policeman.
jbo: mi pulji

source: Don't give up.
jbo: ko na radycru

source: The sky is a pedestral for stars.
jbo: lo tsani cu tsina pe'a fi lo tarci

source: He's wet.
jbo: ra cilmo

source: I have a home.
jbo: da zdani mi

source: You ate an apple, yay!
jbo: do pu citka lo plise ku .ui

source: I am happy that you are my friend.
jbo: mi gleki lo su'u do pendo mi

source: Oy, why do you hit me?!
jbo: .oi do darxi mi mu'i ma

source: Go far away and for a long time!
jbo: ko ve'u ze'u klama

source: You're happy, what have you been doing all this long time until now?
jbo: .ui dai do ca ze'u pu mo

source: You saw the dog that belonged to the man I was flirting with.
jbo: do viska lo gerku pe le se cinjikca be mi

source: I'm trying to become an expert in using axes.
jbo: mi troci lo du'u crebi'o lo ka pilno lo katnymruli

source: Are we acquaintances?
jbo: xu mi'o slabu simxu

source: He's rich.
jbo: ra ricfu

source: I want my food dead. Not sick, not dying, dead.
jbo: mi djica lo nu loi mi cidja cu ba'e morsi .i bilma jebo mrobi'o naje morsi

source: I am so hungry and lunch is not ready.
jbo: .oi mi xagji .ije noda dormijysai

source: Sorry for any mistakes.
jbo: .u'u srera

source: I'm not dead.
jbo: mi na morsi

source: A pound was five dollars.
jbo: lo brityrupnu be li pa pu vamji lo merkyrupnu be li mu

source: Boil the water.
jbo: ko febgau lo djacu

source: She is well-liked by all.
jbo: ko'a se nelci roda

source: I can go, but have not yet gone to Tibet.
jbo: mi nu'o klama la pyd

source: Tell me whom these books belong to!
jbo: ma ralte ti poi cukta

source: A third is less than a half.
jbo: li pa fe'i ci mleca li pa fe'i re

source: God, oh God, why have you forsaken me?
jbo: doi cevni i doi cevni i oire'e iocai mu'i ma do fesli'a mi

source: Her mouth hurt a lot.
jbo: ko'a mutce cortu lo moklu

source: But have you received the messages?
jbo: i ku'i pei do mo'u cpacu lo se mrilu

source: Do you think she would forgive me?
jbo: pei ra fraxu da'i mi

source: Do you think he would forgive me?
jbo: pei ra fraxu da'i mi

source: What is your rating?
jbo: do ma certu klani

source: You forgot to turn off the light.
jbo: do pu de'a morji lo ka sisti gasnu lo gusni

source: Mankind walked on the Moon.
jbo: lo remna cu pu bajra le lunra

source: I became his friend.
jbo: mi binxo pendo ko'a

source: For sale: baby shoes, never used.
jbo: vecnu lo cifnu cutci noi noroi pilno

source: It's better to do nothing than to do something poorly.
jbo: lo nu na gasnu kei lo nu narcertu gasnu cu zmadu lo ka xamgu

source: No worries! This is good enough!
jbo: .o'o ti banzu xamgu

source: That idea's not bad.
jbo: lo selstidi cu milxe xamgu

source: Tom is a competent nurse.
jbo: la .tom. certu kujmikce

source: Her mother is American.
jbo: le mamtu be ko'a cu merko

source: Islamabad is the capital of Pakistan.
jbo: la .islAmabad. cu raltca la .pAkistan.

source: I can speak both English and Spanish.
jbo: mi se bangu lo glibau .e lo sanbau

source: It was easy for her to find a job.
jbo: ko'a se frili lo nu binxo jibri ri

source: It was easy for them to find a hotel.
jbo: do se frili lo nu sispe'i lo xotli

source: It is necessary that I see a doctor.
jbo: mi nitcu lo nu mikce ri

source: It is necessary that we see a doctor.
jbo: mi'a nitcu lo nu mikce ri

source: It is necessary that they see a doctor.
jbo: ko'a nitcu lo nu mikce ri

source: I am proud of my father.
jbo: mi jgira tu'a le patfu be mi

source: I'm tired. I've got to go now.
jbo: .a'enai mi ca cliva .ei

source: Please don't tell anyone.
jbo: .e'o ko na jungau

source: Please keep it a secret.
jbo: .e'o ko mipri

source: Does your school have a library?
jbo: xu da poi ckusro cu srana le do ckule

source: Her skin is white like snow.
jbo: le skapi po'u ko'a lo snime cu simsa lo ka blabi

source: When do they play soccer?
jbo: ca ma za'u ra kelci lo fudbolo

source: I don't eat green peppers at all.
jbo: mi lo crino kapsiku cu na'e citka

source: Proceed with caution.
jbo: .e'unai ko crakla gi'e capyju'i

source: I don't want to get involved.
jbo: mi to'e djica lo nu se cuntu

source: She's in the kitchen.
jbo: ko'a nenri le jupku'a

source: He's in the closet.
jbo: ko'a nenri le sroku'a

source: It makes no sense at all.
jbo: ko'a mutce cfipu

source: I'm working on it.
jbo: mi ca'o gunka

source: I hope someone sees this.
jbo: .a'o da ba zgana

source: I'm sure he would approve.
jbo: mi jinvi lo du'u ko'a ba zanru

source: Did I get it right?
jbo: xu mi pu drani

source: It's getting larger.
jbo: ca'o banro

source: I can't afford it.
jbo: mi na kakne lo nu pleji

source: He was happy that he passed that exam.
jbo: ko'a gleki lo nu pu snada ta poi nu kamjunmre

source: Dogs can see in the dark.
jbo: lo gleki cu ka'e viska seva'o lo manku

source: Please don't hesitate to call.
jbo: .e'o ko tavla mi xecu'u lo fonxa

source: How do we do that?
jbo: ta'i ma mi'ai ei zukte ra

source: A ball hit me in the back of the head while I was playing soccer.
jbo: le bolci cu janli le stedu po'u mi ca'o lo nu mi boltipyjvi

source: Skateboarding is dangerous.
jbo: lo nu se tumskiji cu ckape

source: I'm hungry.
jbo: mi xagji

source: What's wrong with this?
jbo: ma naldrani sera'a ti

source: Where did you hear that?
jbo: bu'u ma do pu tirna zo'e bi'unai

source: Who gave you this?
jbo: ma pu dunda ti do

source: You must have thought of something.
jbo: ju'o do pu pensi da

source: Where've you been?
jbo: ma pu se zvati do

source: Something's missing.
jbo: be'u

source: I just don't believe it.
jbo: .ianaicai

source: I hope I'm not interrupting.
jbo: .io mi do na'e raktu .a'o

source: I highly doubt that.
jbo: mi mutce lo ka senpi

source: I didn't tell anyone what time I'd be arriving.
jbo: mi lo du'u zvati ti'u makau cu cusku noda

source: Although I didn't like math, I had to study logarithms.
jbo: mi to'e nelci lo cmaci .isemu'inai mi tadni .ei lo nundugri

source: He isn't at home.
jbo: ko'a le ri zdani na zvati

source: The number of fools is infinite.
jbo: loi bebna cu ci'imei

source: I don't like Esperanto, because it is too difficult.
jbo: mi to'e nelci la .esperanton. .imu'i dukse nandu

source: In the German language there are many long words.
jbo: loi dotco valsi cu so'imei

source: Pull over here.
jbo: ko sisti vi

source: Don't call me again.
jbo: ko na fonta'a mi

source: Tom ate a piece of the cake that Mary baked.
jbo: la tom pu citka lo spisa be lo titnanba poi la maris pu jukpa

source: Be attentive.
jbo: ko jundi

source: Say cheese.
jbo: ko cusku zo ui

source: Most people think that people shouldn't eat people.
jbo: so'e lo prenu cu jinvi lo du'u lo prenu lo prenu cu ei na citka

source: I need a new car.
jbo: mi nitcu lo ka ralte lo karce poi cnino

source: This is a terrible idea.
jbo: lo selpla cu mutce xlali

source: I'll explain everything.
jbo: mi ba ciksi

source: I can explain everything.
jbo: mi kakne lo ka skicu ro da

source: I'm afraid there's nothing we can do.
jbo: .u'u mi'a nu'o gasnu noda

source: Call the police and tell them what you told me.
jbo: ko skicu lo se skicu be ko bei mi loi pulji

source: You need to calm down.
jbo: ko smacni binxo

source: "Let me hug you." "I'd like that a lot."
jbo: lu mi pamjai ko li'u lu mi mutce nelci li'u

source: Hand over your weapons.
jbo: lebna lo ko xarci ko

source: He's good.
jbo: ko'a xamgu

source: She's good.
jbo: ko'a xamgu

source: Will you accompany me?
jbo: xu do ba kansa mi

source: I'm not good at this.
jbo: mi to'e certu

source: Don't do this to me!
jbo: ko na broda mi

source: I don't need an SUV.
jbo: mi na nitcu la .sy'ubuvys.

source: All is vanity.
jbo: roda ka mlejgi

source: She speaks German.
jbo: ko'a se dotybau

source: She speaks Polish.
jbo: ko'a se bangrpolska

source: I love chocolate.
jbo: mi mutce nelci loi cakla

source: It is said that...
jbo: cusku lo sedu'u mu'onai

source: Shinji ate nine coconuts.
jbo: la .cindji. citka so lo rutrkoko

source: Please read the text below.
jbo: .e'o ko ni'a tcidu

source: mind the gap!
jbo: .e'o ko junri lo selku'e

source: There is a big difference between learning a language in order to understand or to say something if needed, and wanting to acquire a second language in order to command it freely, almost like you command your first language, your mother tongue.
jbo: lo nu cilre lo bangu mu'i lo nu jimpe ja cusku ku ku mutce frica lo nu cilre lo bangu mu'i lo nu zifre pilno pa'a lo verclibau

source: I don't want to buy that house from him.
jbo: mi na djica lo nu terve'u lo zdani ko'a

source: I am so sorry.
jbo: .u'ucai

source: He tricked me.
jbo: ko'a tcica mi

source: She tricked me.
jbo: ko'a tcica mi

source: I want a divorce.
jbo: mi djica lo nu spesti

source: Nice shot!
jbo: certu cecla

source: He won a sizeable amount of money.
jbo: ko'a jinga loi so'i jdini

source: "Where's Tom?" "How would I know?"
jbo: ma se zvati la tom i ta'i ma mi djuno da'i

source: He doesn't speak my language.
jbo: ko'a se bangu nai lo pe mi bangu

source: Don't worry. I won't hurt her.
jbo: ko na xanka .i mi na'e xrani ko'a

source: Don't look at Tom. Look at me.
jbo: ko viska la .tam. na.e mi

source: Don't leave.
jbo: ko na cliva

source: Don't gloat.
jbo: ko na jgidu'esku

source: Don't do it.
jbo: ko na co'e

source: Don't die.
jbo: ko na mrobi'o

source: Don't be silly. I can't do it.
jbo: ko na bebna .i mi na kakne

source: Don't be rude.
jbo: ko na tolclite

source: Stay here with Tom.
jbo: ko vi stali vi la .tam.

source: Let me help.
jbo: ko se sidju be mi curmi

source: Get some sleep.
jbo: ko sipna

source: Cool down.
jbo: ko smacni

source: Come back here.
jbo: ko ti xrukla

source: I am not interested in this.
jbo: ti na cinri mi

source: I cook, but I don't do that with much pleasure.
jbo: mi jukpa gi'eku'i tolnelci

source: No smoking!
jbo: ko na sigva'u

source: The bread is not fresh.
jbo: loi nanba cu norvifne

source: I'll email you in Chinese later.
jbo: mi ba samymri fi do bau lo jugbau

source: Tom tried to save me.
jbo: la .tom. pu troci lo ka nurxrugau mi

source: Tom tried to pick up his keys with his toes.
jbo: la .tam. troci lo nu jgari lo ty. ckiku lo ty. jmadegji

source: Tom ripped me off.
jbo: la tom pu zerle'a fi mi

source: Tom looks like you.
jbo: la .tam. cu simsa do

source: Tom looks frustrated.
jbo: la .tam. cu simlu lo ka se fanza

source: Tom looks exhausted.
jbo: la .tam. cu simlu lo ka tatpi

source: Tom looks confused.
jbo: la .tam. cu simlu lo ka se cfipu

source: Tom looks angry.
jbo: la .tam. cu simlu lo ka fengu

source: Tom looks a little nervous.
jbo: la .tam. cu simlu lo ka milxe xanka

source: Tom looked at the floor.
jbo: la .tam. cu viska lo loldi

source: Tom looked at the clock.
jbo: la .tam. cu viska lo junla

source: Tom looked at Mary.
jbo: la .tam. cu viska la .meris.

source: Tom is still alive.
jbo: la tom ca za'o jmive

source: Tom is scared.
jbo: la .tam. terpa

source: Tom is dead.
jbo: la .tam. morsi

source: Tom is a guest.
jbo: la .tam. vitke

source: Tom hates you.
jbo: la .tam. do xebni

source: Tom hates me.
jbo: la .tam. mi xebni

source: You forgot his name.
jbo: do co'u morji tu'a lo cmene be ra

source: I am not thirsty.
jbo: mi na taske

source: Tom seemed quite surprised when he heard that Mary and John had gotten married.
jbo: la .tam. pu simlu milxe bo spaji lo nu facki lo nu la .meris. la .djan. spebi'o

source: Dad went to the bank because he was short of mn.
jbo: le patfu pu klama le banxa ki'u lo nu vo'a claxu lo jdini

source: How mn bridges are there across the River Thames?
jbo: xo cripu be la temsas. poi rirxe cu zasti

source: John walked over the bridge and crossed the road.
jbo: la djan. pu klama fo lo cripu gi'e pu pagre lo dargu

source: Come to the front of the classroom.
jbo: ko klama lo crane be le kulku'a

source: There are lot of beautiful buildings in this town.
jbo: so'i melbi dinju cu zvati lo vi tcadu

source: Our father goes to work by car.
jbo: lo mi'a patfu ta'e klama lo briju fu lo karce

source: Bb got into his car.
jbo: la bab. pu nerkla lo ri karce

source: John's house is opposite the church.
jbo: lo dinju pe la djan. cu crane lo malsi

source: The church was built in the fifteenth century.
jbo: lo malsi pu se zbasu ca lo pamumoi ctona'a

source: Bob's father works in car factory.
jbo: lo fanri be lo karce cu briju lo patfu be la bab

source: The dog jumped over the fence.
jbo: lo gerku cu pipkla fo lo bitmu

source: We squeezed through hole in the fence.
jbo: mi'a pagre lo kevna be lo bitmu

source: Where's the nearest hotel?
jbo: ma se zvati lo jbirai xotli

source: I know very nice little hotel quite close to here.
jbo: mi djuno lo du'u makau se zvati pa vi xamgu ke cmalu xotli

source: Can you tell me the way to the library?
jbo: ju'i do ma ve pluta lo ckuzda

source: Is that a library book or is it your own copy?
jbo: lo vi cukta cu se ponse do gi'i bevri fo lo ckuzda

source: Grandma went to the market to buy food for the family.
jbo: lo mamymamta pu klama le zarci tezu'e lo nu te vecnu lo cidja be lo lanzu

source: One learns from one's mistakes.
jbo: cilre fo lo se srera

source: Everyone, say cheese.
jbo: ro ko cusku zo ui

source: I sent her birthday present b post.
jbo: mi mrilu lo se dunda ko'a ki'u lo zi jbesla be ko'a

source: My home is yours.
jbo: lo zdani be mi cu se ralte do

source: She's a sweet girl.
jbo: ko'a pukclite

source: He's a sweet guy.
jbo: ko'a pukclite

source: I hate my parents.
jbo: mi xebni lo rirni be mi

source: I love my parents.
jbo: mi prami lo rirni be mi

source: He is a prestigious and influential member of the Democratic Party.
jbo: ko'a vajni cmima la'o gy. Democratic Party .gy.

source: He's annoying.
jbo: ko'a fanza

source: Do you participate in the marathon?
jbo: xu do clabajykla

source: Tom grabbed Mary to keep her from falling.
jbo: la .tam. la .meris. cu jgari mu'i lo nu farlu fanta

source: You are really very good.
jbo: do je'a mutce certu

source: How did you get here?
jbo: do zvati ta'i ma

source: Have you slept?
jbo: xu do pu sipna

source: Does Tom know?
jbo: la .tam. djuno xu

source: Do you want to try it?
jbo: xu do djica lo nu do troci

source: Do you promise?
jbo: nu'epei

source: Do you know where we're going?
jbo: xu do djuno fi lo se klama be mi'o

source: Do you have any weapons?
jbo: xu do ralte lo xarci

source: Did you try it?
jbo: xu do troci

source: Did you get it?
jbo: do ko'a cpacu xu

source: Did I do that?
jbo: mi co'e xu

source: Can I join you?
jbo: .e'o mi kansa do
